_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 25, 25, 64)        5248      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 25, 25, 32)        2080      
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 21, 21, 1)         801       
=================================================================
Total params: 8,129
Trainable params: 8,129
Non-trainable params: 0
_________________________________________________________________
Training took: 0.0635 hour(s)