_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 33, 33, 3)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 33, 33, 32)        896       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 33, 33, 16)        528       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 33, 33, 8)         1160      
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 33, 33, 3)         27        
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 66, 66, 3)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 66, 66, 8)         224       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 66, 66, 16)        144       
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 66, 66, 32)        4640      
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 66, 66, 3)         867       
=================================================================
Total params: 8,486
Trainable params: 8,486
Non-trainable params: 0
_________________________________________________________________
Training took: 0.3306 hour(s)